app/Controllers/Client/OperationController.php

    public function retraitProcess()
    {
        $montant = (float) $this->request->getPost('montant');

        if ($montant <= 0) {
            return redirect()->back()->withInput()->with('error', 'Montant invalide.');
        }

        $client = $this->clientModel->find(session('client_id'));
        $typeRetrait = $this->typeOperationModel->getByCode('retrait');
        $frais = $this->baremeFraisModel->calculerFrais($typeRetrait['id'], $montant);
        $totalADebiter = $montant + $frais;

        if ((float) $client['solde'] < $totalADebiter) {
            return redirect()->back()->withInput()->with('error', 'Solde insuffisant.');
        }

        $this->clientModel->debiter($client['id'], $totalADebiter);
        $this->transactionModel->insert([
            'type_operation_id' => $typeRetrait['id'],
            'client_source_id' => $client['id'],
            'client_destination_id' => null,
            'montant' => $montant,
            'frais' => $frais,
        ]);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
INSERT INTO `transactions` (`type_operation_id`, `client_source_id`, `client_destination_id`, `montant`, `frais`) VALUES (2, 1, NULL, 45000, 500)

    public function transfertProcess()
    {
        $montantTotal = (float) $this->request->getPost('montant');
        $numeroUnique = trim((string) $this->request->getPost('numero_destination'));
        $numerosMultiples = trim((string) $this->request->getPost('numeros_destinataires'));
        $inclureFraisRetrait = $this->request->getPost('inclure_frais_retrait') === '1';
        $client = $this->clientModel->find(session('client_id'));
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 4