EXAMENFINALS4-main/app/Controllers/Client/DashboardController.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
---
    public function index()
    {
        $clientModel = new ClientModel();
        $client  = $clientModel->find(session('client_id'));