app/Controllers/CompteOperateurController.php

    public function index()
    {
        $data['comptes'] = $this->model
            ->select('comptes_operateurs.*, operateurs.nom as operateur_nom')
            ->join('operateurs', 'operateurs.id = comptes_operateurs.operateur_id')
            ->findAll();
---
SELECT `comptes_operateurs`.*, `operateurs`.`nom` as `operateur_nom`
FROM `comptes_operateurs`
JOIN `operateurs` ON `operateurs`.`id` = `comptes_operateurs`.`operateur_id`