app/Controllers/CompteClientController.php

    public function index()
    {
        $data['clients'] = $this->model->orderBy('numero')->findAll();
---
SELECT *
FROM `clients`
ORDER BY `numero`