app/Controllers/OperateurController.php

SELECT *
FROM `operateurs`
---
    public function index()
    {
        $data['operateurs'] = $this->model->findAll();