app/Controllers/PrefixeController.php

SELECT `prefixes`.*, `operateurs`.`nom` as `operateur_nom`
FROM `prefixes`
JOIN `operateurs` ON `operateurs`.`id` = `prefixes`.`operateur_id`
---
    public function index()
    {
        $data['prefixes'] = $this->model
            ->select('prefixes.*, operateurs.nom as operateur_nom')
            ->join('operateurs', 'operateurs.id = prefixes.operateur_id')
            ->findAll();

SELECT *
FROM `operateurs`
---
    public function new()
    {
        $data['operateurs'] = $this->operateurModel->findAll();

SELECT *
FROM `operateurs`
---
    public function edit($id)
    {
        $data['prefixe'] = $this->model->find($id);
        $data['operateurs'] = $this->operateurModel->findAll();