app/Models/ClientModel.php

SELECT *
FROM `clients`
WHERE `numero` = '0371234567'
 LIMIT 1
---
    public function findByNumero(string $numero)
    {
        return $this->where('numero', $numero)->first();

UPDATE `clients` SET `solde` = solde + 4000
WHERE `id` = 2
---
    public function crediter(int $id, float $montant): bool
    {
        return $this->set('solde', 'solde + ' . $montant, false)
                     ->where('id', $id)
                     ->update();

UPDATE `clients` SET `solde` = solde - 4200
WHERE `id` = 1
---
    public function debiter(int $id, float $montant): bool
    {
        return $this->set('solde', 'solde - ' . $montant, false)
                     ->where('id', $id)
                     ->update();