app/Models/PrefixeModel.php

SELECT *
FROM `prefixes`
WHERE `prefixe` = '033'
 LIMIT 1
---
    public function estValide(string $prefixe)
    {
        $prefixe = substr($prefixe, 0, 3); // On prend les 3 premiers caractères du numéro
        return (bool) $this->where('prefixe', $prefixe)->first();

SELECT `operateurs`.*
FROM `prefixes`
JOIN `operateurs` ON `operateurs`.`id` = `prefixes`.`operateur_id`
WHERE `prefixes`.`prefixe` = '033'
 LIMIT 1
---
    public function getOperateurByNumero(string $numero)
    {
        $prefixe = substr($numero, 0, 3);
        return $this->select('operateurs.*')
                    ->join('operateurs', 'operateurs.id = prefixes.operateur_id')
                    ->where('prefixes.prefixe', $prefixe)
                    ->first();