app/Models/TransactionModel.php

SELECT `transactions`.*, `types_operation`.`libelle` as `type_libelle`
FROM `transactions`
JOIN `types_operation` ON `types_operation`.`id` = `transactions`.`type_operation_id`
WHERE   (
`client_source_id` = 4
OR `client_destination_id` = 4
 )
ORDER BY `date_operation` DESC
 LIMIT 10
---
        public function historiqueClient(int $clientId, int $limit = 50)
    {
        return $this->select('transactions.*, types_operation.libelle as type_libelle')
                    ->join('types_operation', 'types_operation.id = transactions.type_operation_id')
                    ->groupStart()
                        ->where('client_source_id', $clientId)
                        ->orWhere('client_destination_id', $clientId)
                    ->groupEnd()
                    ->orderBy('date_operation', 'DESC')
                    ->limit($limit)
                    ->find();